


/*lint -e767*/
#define    THIS_FILE_ID        PS_FILE_ID_PSMUX_C
/*lint +e767*/

/*****************************************************************************
  1 头文件包含
*****************************************************************************/
#include "product_config.h"


/*****************************************************************************
  1 头文件包含
*****************************************************************************/
#include "AtMuxInterface.h"

/*****************************************************************************
  3 函数实现
*****************************************************************************/
/*****************************************************************************
 函 数 名  : MUX_DlciDlDataSend
 功能描述  : MUX的下行数据接收函数API(STUB!!!)
 输入参数  : AT_MUX_DLCI_TYPE_ENUM_UINT8   enDlci      链路号
             VOS_UINT8                     *pData      输入数据指针
             VOS_UINT32                     ulDataLen  输入数据长度
 输出参数  : 无
 返 回 值  : 无

 调用函数  :

 被调函数  :

 修改历史      :
  1.日    期   : 2012年8月10日
    作    者   : h00163499
    修改内容   : 新生成函数

*****************************************************************************/
VOS_UINT32 MUX_DlciDlDataSend (AT_MUX_DLCI_TYPE_ENUM_UINT8 enDlci, VOS_UINT8* pData, VOS_UINT16 usDataLen)
{
    return VOS_OK;
}

/*****************************************************************************
 函 数 名  : MUX_AtRgstUlPortCallBack
 功能描述  : AT模块向MUX模块注册的上行回调函数 (STUB)
 输入参数  : AT_MUX_DLCI_TYPE_ENUM_UINT8   enDlci      链路号
             RCV_UL_DLCI_DATA_FUNC         pFunc       上行数据处理函数指针
 输出参数  : 无
 返 回 值  : 无

 调用函数  :

 被调函数  :

 修改历史      :
  1.日    期   : 2012年8月10日
    作    者   : h00163499
    修改内容   : 新生成函数

*****************************************************************************/
VOS_UINT32 MUX_AtRgstUlPortCallBack (AT_MUX_DLCI_TYPE_ENUM_UINT8 enDlci, RCV_UL_DLCI_DATA_FUNC pFunc)
{
    return VOS_OK;
}

/*****************************************************************************
 函 数 名  : MUX_Pid_InitFunc
 功能描述  : MUX模块 PID初始化
 输入参数  : VOS_INIT_PHASE_DEFINE ip   初始化类型
 输出参数  : 无
 返 回 值  : VOS_UINT32
 调用函数  :
 被调函数  : 模块初始化函数

 修改历史      :
  1.日    期   : 2012年8月10日
    作    者   : h00163499
    修改内容   : 新生成函数
*****************************************************************************/
VOS_UINT32 MUX_Pid_InitFunc( enum VOS_INIT_PHASE_DEFINE ip )
{
    return VOS_OK;
}

/*****************************************************************************
 函 数 名  : MUX_AtMsgProc
 功能描述  : MUX接收来自AT模块的消息处理函数
 输入参数  : MsgBlock *pMsgBlock    从AT发来的消息

 输出参数  : 无
 返 回 值  : VOS_UINT32
 调用函数  : 模块初始化函数，在NDIS任务中
 被调函数  :

 修改历史      :
  1.日    期   : 2012年8月10日
    作    者   : h00163499
    修改内容   : 新生成函数

*****************************************************************************/
VOS_UINT32 MUX_AtMsgProc( const MsgBlock *pMsgBlock )
{
    return VOS_OK;
}



