

/*****************************************************************************
  1 头文件包含
*****************************************************************************/
#include "CsdInit.h"





/*****************************************************************************
    协议栈打印打点方式下的.C文件宏定义
*****************************************************************************/
/*lint -e767 */
#define    THIS_FILE_ID                 PS_FILE_ID_CSD_INIT_C
/*lint -e767 */

/*****************************************************************************
 函 数 名  : CSD_FidInit
 功能描述  : CSD FID初始化
 输入参数  : enInitPhase:初始化阶段
 输出参数  : 无
 返 回 值  : VOS_OK:初始化成功
             VOS_ERR:初始化失败
 调用函数  :
 被调函数  :

 修改历史      :
 1.日    期   : 2011年12月6日
   作    者   : w00199382
   修改内容   : 新生成函数

*****************************************************************************/
VOS_UINT32 CSD_FidInit (enum VOS_INIT_PHASE_DEFINE  enInitPhase)
{
    return VOS_OK;
}




