

#include "bsp_applog.h"
#include "bsp_slice.h"


/*****************************************************************************
* 函 数 名  : mdrv_applog_conn
*
* 功能描述  :与工具连接状态设置
*
* 输入参数  : 无
*
* 输出参数  : 无
*
* 返 回 值  : 成功与否标识码

 修改历史	:
 日    期	: 2016年4月8日
 作    者	: x00346372
 修改内容	:
*****************************************************************************/
int mdrv_applog_conn(void)
{
    return 0;
}
/*****************************************************************************
* 函 数 名  : mdrv_applog_cfg
*
* 功能描述  :开关状态、打印级别设置
*
* 输入参数  : 无
*
* 输出参数  : 无
*
* 返 回 值  : 成功与否标识码

 修改历史	:
 日    期	: 2016年4月8日
 作    者	: x00346372
 修改内容	:
*****************************************************************************/
int mdrv_applog_cfg(unsigned int enable,unsigned int level)
{
    return 0;
}




