

#ifndef __MDRV_ACORE_APPLOG_H__
#define __MDRV_ACORE_APPLOG_H__
#ifdef __cplusplus
extern "C"
{
#endif

/*****************************************************************************
* 函 数 名  : mdrv_applog_conn
*
* 功能描述  :与工具连接状态设置
*
* 输入参数  : 无
*
* 输出参数  : 无
*
* 返 回 值  : 成功与否标识码

 修改历史	:
 日    期	: 2016年4月8日
 作    者	: x00346372
 修改内容	:
*****************************************************************************/
int mdrv_applog_conn(void);
/*****************************************************************************
* 函 数 名  : mdrv_applog_level
*
* 功能描述  :打印级别设置
*
* 输入参数  : 无
*
* 输出参数  : 无
*
* 返 回 值  : 成功与否标识码

 修改历史	:
 日    期	: 2016年4月8日
 作    者	: x00346372
 修改内容	:
*****************************************************************************/
int mdrv_applog_cfg(unsigned int enable, unsigned int level);

#ifdef __cplusplus
}
#endif
#endif
