/******************************************************************************

                  版权所有 (C), 2001-2011, 华为技术有限公司

 ******************************************************************************
  文 件 名   : errlog_cfg.h
  版 本 号   : 初稿
  作    者   : d00212987
  生成日期   : 2016年3月7日
  最近修改   :
  功能描述   : errlog_cfg.c 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2016年3月7日
    作    者   : d00212987
    修改内容   : 创建文件

******************************************************************************/
#ifndef __ERRLOG_CFG_H__
#define __ERRLOG_CFG_H__

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include "vos.h"
#include "product_config.h"
#include "errlog_faultiddef.h"
#include "cttf_errlog_cfg.h"
#include "nas_errlog_cfg.h"
#include "cas_errlog_cfg.h"
#include "csdr_errlog_cfg.h"
#include "cproc_errlog_cfg.h"

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif

#pragma pack(4)

/*****************************************************************************
  2 宏定义
*****************************************************************************/
#define   FAULT_ID_CONTAIN_ALARM_ID_MAX_NUM   (256) /* ERRLOG 支持一个faultid关联256个alarm_id */
#define   ERR_LOG_PID_MAX_NUM                 (256) /* ERRLOG 支持256个PID */


/*****************************************************************************
  3 枚举定义
*****************************************************************************/


/*****************************************************************************
  4 全局变量声明
*****************************************************************************/


/*****************************************************************************
  5 消息头定义
*****************************************************************************/


/*****************************************************************************
  6 消息定义
*****************************************************************************/


/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/

typedef struct
{
    VOS_UINT32                            ulPid;
    VOS_UINT32                            ulAlarmID;
}ERR_LOG_ALARM_STRU;

/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/


/*****************************************************************************
  10 函数声明
*****************************************************************************/

extern VOS_INT32 ErrLog_GetErrlogPid(
           VOS_UINT32                          ulModemId,
           VOS_UINT32                         *PaulPidArray,
           VOS_UINT32                         *pulPidNum
       );
extern VOS_INT32 ErrLog_GetErrReptAddrAndSize(
           VOS_UINT32                          ulModemId,
           VOS_UINT_PTR                       *pulErrLogAddr,
           VOS_UINT32                         *pulsize
       );
extern VOS_INT32 ErrLog_GetPidAndAlarmId(
           VOS_UINT32                          ulModemId,
           VOS_UINT32                          ulFaultId,
           ERR_LOG_ALARM_STRU                 *paustAlarmArray,
           VOS_UINT32                         *pulAlarmNum
       );



#if (VOS_OS_VER == VOS_WIN32)
#pragma pack()
#else
#pragma pack(0)
#endif


#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif

#endif
