/******************************************************************************

                  版权所有 (C), 2001-2011, 华为技术有限公司

 ******************************************************************************
  文 件 名   : errlog_faultiddef.h
  版 本 号   : 初稿
  作    者   : d00212987
  生成日期   : 2016年3月7日
  最近修改   :
  功能描述   : errlog_faultiddef.h头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2016年3月7日
    作    者   : d00212987
    修改内容   : 创建文件

******************************************************************************/
#ifndef __ERRLOG_CFG_FAULT_ID_DEF_H__
#define __ERRLOG_CFG_FAULT_ID_DEF_H__

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include "vos.h"
#include "product_config.h"

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif

#pragma pack(4)

/*****************************************************************************
  2 宏定义
*****************************************************************************/


/*****************************************************************************
  3 枚举定义
*****************************************************************************/

/*****************************************************************************
 枚举名    : ERR_LOG_FAULT_ID_ENUM
 枚举说明  : FAULT ID

  1.日    期   : 2016年02月17日
    作    者   : d00212987
    修改内容   : ERR LOG FAULT ID关联项目新增枚举
*****************************************************************************/
enum ERR_LOG_FAULT_ID_ENUM
{
    /* TODO: python search flag satrt */
    FAULT_ID_GU_ERR_LOG_REPT                = 0X00, /* GU ErrLog 上报相关 */

    FAULT_ID_1X_OOS                         = 0XA1, /* 1x掉网 */
    FAULT_ID_1X_MO_CALL_FAIL                = 0XA2, /* 1x主叫失败 */
    FAULT_ID_1X_MT_CALL_FAIL                = 0XA3, /* 1x被叫失败 */
    FAULT_ID_1X_CALL_EXCEPTION              = 0XA4, /* 1x掉话 */
    FAULT_ID_1X_REG_FAIL                    = 0XA5, /* 注册失败 */
    FAULT_ID_1X_SHORT_MSG_SEND_FAIL         = 0XA6, /* 短息发送失败 */
    FAULT_ID_1X_SHORT_MSG_RCV_FAIL          = 0XA7, /* 短息接收失败 */
    FAULT_ID_1X_OOS_RECOVERY                = 0XA8, /* 1x掉网恢复 */
    FAULT_ID_1X_VOICE_QUALITY_BAD           = 0XB1, /* 语音质量差 */
    FAULT_ID_HRPD_OR_LTE_OOS                = 0XC1, /* CL模式下HRPD或LTE丢网*/
    FAULT_ID_HRPD_PS_CALL_EXCEPTION         = 0XC2, /* PS呼叫失败 */
    FAULT_ID_HRPD_PS_SESSION_EXCEPTION      = 0XC3, /* PS会话异常 */
    FAULT_ID_HRPD_PS_DISC_EXCEPTION         = 0XC4, /* PS断链 */
    FAULT_ID_CL_OOS_SEARCH                  = 0XC5, /* CL多模搜网过程 */
    FAULT_ID_HRPD_OR_LTE_OOS_RECOVERY       = 0XC6, /* CL模式下HRPD或LTE掉网恢复 */
    FAULT_ID_HRPD_EXCEPTION_COLLECTION      = 0XC7, /* 通用异常收集 */

    /* TODO: python search flag end */
    FAULT_ID_ERR_LOG_ENUM_BUT
};


/*****************************************************************************
  4 全局变量声明
*****************************************************************************/


/*****************************************************************************
  5 消息头定义
*****************************************************************************/


/*****************************************************************************
  6 消息定义
*****************************************************************************/


/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/


/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/


/*****************************************************************************
  10 函数声明
*****************************************************************************/


#if (VOS_OS_VER == VOS_WIN32)
#pragma pack()
#else
#pragma pack(0)
#endif


#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif

#endif
